#include "BatteryAlarm.h"
#include "BatteryDefine.h"
#include "SystemManager.h"

BatteryOneShotAlarm *BatteryOneShotAlarm::_selfObj = NULL;

/**************************************************************************************************
 * 报警源的名字。
 *************************************************************************************************/
QString BatteryOneShotAlarm::getAlarmSourceName(void)
{
    return "BatteryOneShotAlarm";
}

/**************************************************************************************************
 * 报警源的个数。
 *************************************************************************************************/
int BatteryOneShotAlarm::getAlarmSourceNR(void)
{
    return BAT_ONESHOT_NR;
}

/**************************************************************************************************
 * 技术报警报警级别。
 *************************************************************************************************/
AlarmPriority BatteryOneShotAlarm::getAlarmPriority(int id)
{
    switch (id)
    {
        case BAT_ONESHOT_LOW_BATTERY:
        case BAT_ONESHOT_REPLACE_BATTERY:
            return ALARM_PRIO_HIGH;

        case BAT_ONESHOT_NO_BATTERY:
            return ALARM_PRIO_PROMPT;

        default:
            return ALARM_PRIO_LOW;
    }
}

/**************************************************************************************************
 * 该报警是否为生命报警，技术报警和生理/生命报警分开存放。
 *************************************************************************************************/
AlarmType BatteryOneShotAlarm::getAlarmType(int /*id*/)
{
    return ALARM_TYPE_TECH;
}

/**************************************************************************************************
 * 将报警ID转换成字串。
 *************************************************************************************************/
const char *BatteryOneShotAlarm::toString(int id)
{
    return BatterySymbol::convert((BatOneShotType)id);
}

/**************************************************************************************************
 * 获取报警对应的波形ID，该波形将被存储。
 *************************************************************************************************/
WaveformID BatteryOneShotAlarm::getWaveformID(int /*id*/)
{
    return WAVE_NONE;
}

/**************************************************************************************************
 * 构造。
 *************************************************************************************************/
BatteryOneShotAlarm::BatteryOneShotAlarm()
{

}

/**************************************************************************************************
 * 析构。
 *************************************************************************************************/
BatteryOneShotAlarm::~BatteryOneShotAlarm()
{

}

